pwbf/RX64M_Vibration/src/r_cmt_rx/src/r_cmt_rx.c
                    switch (channel)
                    {
                        case 0:
                            CMT.CMSTR0.BIT.STR0 = 0;
                        break;
                        case 1:
                            CMT.CMSTR0.BIT.STR1 = 0;
                        break;

                        #if   CMT_RX_NUM_CHANNELS == 4
                        case 2:
                            CMT.CMSTR1.BIT.STR2 = 0;
                        break;
                        case 3:
                            CMT.CMSTR1.BIT.STR3 = 0;
                        break;
                        #endif

                        default:
                        break;
                    }
                }
            }
            break;


        /* Both restart and resume do the same thing, except restart zeros the counter first */ 
        case CMT_RX_CMD_RESTART:
        case CMT_RX_CMD_RESUME:
            if (channel < CMT_RX_NUM_CHANNELS)
            {
                /* Valid channel input. Is this channel currently counting? */
                if (CMT_RX_MODE_DISABLED != g_cmt_modes[channel])
                {

                    if (CMT_RX_CMD_RESTART == command)
                    {
                      /* For restarting, clear counter. */
                      (*g_cmt_channels[channel]).CMCNT = 0;
                    }

                    switch (channel)
                    {
                    case 0:
                        CMT.CMSTR0.BIT.STR0 = 1;
                        break;
                    case 1:
                        CMT.CMSTR0.BIT.STR1 = 1;
                        break;
#if   CMT_RX_NUM_CHANNELS == 4
                    case 2:
                        CMT.CMSTR1.BIT.STR2 = 1;
                        break;
                    case 3:
                        CMT.CMSTR1.BIT.STR3 = 1;
                        break;
#endif
                    default:
                        break;
                    }
                }
            }
            break;

        default:
            ret = false;
        break;
    }

    return ret;
} 

/***********************************************************************************************************************
* Function Name: cmt_create
* Description  : Sets up a CMT channel based on user input options.
* Arguments    : frequency_hz -
*                    Frequency in Hz of how often to call the callback function.
*                callback -
*                    Which function to call when timer expires.
*                channel -
*                    Pointer of where to store which channel was used.
* Return Value : true - 
*                    Channel initialized successfully.
*                false -
*                    Invalid channel or period could not be used.
***********************************************************************************************************************/
static bool cmt_create (uint32_t frequency_hz, void (* callback)(void * pdata), cmt_modes_t mode, uint32_t * channel)
{
    /* Return value. */
    bool     ret = false;    

    /* Grab state to make sure we do not interfere with another operation. */
    if (cmt_lock_state() != true)
    {
        /* Another operation is already in progress. */
        return false;
    }

    /* Was a channel found? */
    if (false == cmt_find_channel(channel))
    {
        /* Channel not found or not available. */
        ret = false;
    }
    else
    {
        /* Look to see if we can support this frequency. */
        ret = cmt_setup_channel(*channel, frequency_hz);
    
        /* Set up ICU registers, save callback function, and start counter if valid divider was found. */
        if (ret == true)
        {        
            /* Set mode of operation. */
            g_cmt_modes[*channel] = mode;
    
            /* Save callback function to be used. */
            g_cmt_callbacks[*channel] = callback;
    
            /* Start channel counting. */
            cmt_counter_start(*channel);
        }
        else
        {
            /* Could not support input frequency. Release lock on channel. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMT0 + *channel));
        }
    }

    /* Release state so other operations can be performed. */
    cmt_unlock_state();

    return ret;
}

/***********************************************************************************************************************
* Function Name: cmt_lock_state
* Description  : Attempt to lock the state so that we right to perform an operation.
* Arguments    : channel - 
*                    Which channel to use.
* Return Value : true - 
*                    State was obtained
*                false - 
*                    State was not obtained because code is busy with another on-going operation.
***********************************************************************************************************************/
static bool cmt_lock_state (void)
{
    bool ret;

    /* Attempt to acquire lock. */
    ret = R_BSP_HardwareLock(BSP_LOCK_CMT);

    return ret;
}

/***********************************************************************************************************************
* Function Name: cmt_unlock_state
* Description  : Release state so that other operations can be performed.
* Arguments    : channel - 
*                    Which channel to use.
* Return Value : none
***********************************************************************************************************************/
static void cmt_unlock_state (void)
{
    /* Release lock. */
    R_BSP_HardwareUnlock(BSP_LOCK_CMT);
}

/***********************************************************************************************************************
* Function Name: cmt_find_channel
* Description  : Attempt to find open CMT channel to use.
* Arguments    : channel - 
*                    Channel number if channel was found.
* Return Value : true -
*                    Channel was found and locked.
*                false -
*                    No channels available.
***********************************************************************************************************************/
static bool cmt_find_channel (uint32_t * channel)
{
    bool     channel_found = false;
    uint32_t i;

