pwbf/RX64M_Vibration/src/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: cmt0_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmt0_isr(vect=VECT(CMT0, CMI0))
static void cmt0_isr (void)
{
    cmt_isr_common(0);
}

/***********************************************************************************************************************
* Function Name: cmt1_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmt1_isr(vect=VECT(CMT1, CMI1))
static void cmt1_isr (void)
{
    cmt_isr_common(1);
}

#if   CMT_RX_NUM_CHANNELS == 4
/***********************************************************************************************************************
* Function Name: cmt2_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmt2_isr(vect=VECT(CMT2, CMI2))
static void cmt2_isr (void)
{
    cmt_isr_common(2);
}

/***********************************************************************************************************************
* Function Name: cmt3_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#pragma interrupt cmt3_isr(vect=VECT(CMT3, CMI3))
static void cmt3_isr (void)
{
    cmt_isr_common(3);
}
#endif


